package Homeworks.Homeworks3_9;

public class HW_8 {
// Задача №1
//
//Необходимо создать класс Homeworks.Homeworks9.Person с полями: имя, возраст, пол. Класс должен иметь метод - getName,
// метод возвращает имя с префиксом “Mr. ” если пол указан как мужской и префикс “Mrs. ” если женский.
//
//
//Задача №2
//
//Создать класс Employee , в котором хранится информация о сотруднике предприятия: имя, месячная
// зарплата, количество детей.
//Создать класс TaxPayment, в котором будет храниться имя сотрудника, и сумма подоходного налога,
// который он должен будет заплатить.
//Создать статический метод метод, который получит массив сотрудников, и вернет (или распечатает,
// но лучше, если вернет) массив налоговых выплат (TaxPayment) по следующему правилу:
//Если зарплата больше 10000, то налоговая ставка 23%
//Если зарплата от 5000 до 10000, то налог составляет 18%
//Если зарплата меньше 5000, то налог составляет 13%
//За каждого ребенка из зарплаты вычитается 1000, и налог берется с оставшейся суммы.
//
//
//
//Задача №4
//
//Написать статический метод, превращающий натуральное (целое положительное) число (например, 643)
// в строку, состоящую из названий цифр этого числа (например, “шесть четыре три”).

//  Задача 1
//    public class Homeworks.Homeworks9.Person {
//        String name;
//        String gender ;
//        int age;
//
//        String getName() {
//            if (gender.equals("male")) {
//                return "Mr. " + name;}
//            else {
//                return "Mrs. " + name;}
//
//
//       }
//    }
//
//    /// Задача 2
//    public class Employee {
//        String name;
//        double salary;
//        int numberOfChildren;
//
//    }
//
//    public class TaxPayment {
//        String name;
//        double incomeTax;
//
//    }
//
//    public class TaxCalculator {

   // Задача №3
//
//Необходимо создать класс Homeworks.Homeworks9.Salary с единственным статическим методом - getSum(Employee[] employeeArray),
// метод должен возвращать сумму зарплат всех сотрудников из массива переданного в качестве аргумента вызова метода.
//
public class Salary {
    int salary;



   }


}




